<?php

//Выполняет проверку на соответствие регулярному выражению
echo '<br>======================================================================<br>';
echo '<b>Пример №4 - preg_match.php</b> Функция preg_match<br>';
echo '('.__FILE__.')'.'<br>';

// Символ "i" после закрывающего ограничителя шаблона означает
// регистронезависимый поиск.
$text="PHP is the web scripting language of choice.";
if (preg_match("/php/i", $text)) {
    echo "<br>Вхождение найдено.";
} else {
    echo "<br>Вхождение не найдено.";
}
